IDEA Open Model
OpenModel.AddObject Method (OpenAttribute)
Compatible with IDEA StatiCa Beta 20.0
 Add new atribute object into collections
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public int AddObject(
	OpenAttribute obj
)
Public Function AddObject (
	obj As OpenAttribute
) As Integer
Parameters
obj
Type: IdeaRS.OpenModel.OpenAttribute
Added object
Return Value
Type: Int32
Return value 0 - OK, -1 - false
Remarks
See Also
Reference
OpenModel Class
AddObject Overload
IdeaRS.OpenModel Namespace